#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.main: Refreshing state... [id=6a8f452cca235925e467b9aef3685f91ab818d44]
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03OTg4YzcyYy1lZjJiLTQxMWUtYjkxZS0yYjM0ZjY5NzRjYjQ7b2JqZWN0SWQ9MmJlYjRmYmUtOWUyZS00N2NjLWFlMWItZmE2YmUzOGYwZGZiO3N1YnNjcmlwdGlvbklkPTExZWIyYTQ5LWYyYmUtNDhlZS1hMWIzLTExM2EwMWQ3OWZmYzt0ZW5hbnRJZD1jNTAwZDhhZi03MTVmLTQ3YTgtODI2ZS0wN2JlNDU4ODM2YmM=]
data.azurerm_resource_group.example: Read complete after 0s [id=/subscriptions/11eb2a49-f2be-48ee-a1b3-113a01d79ffc/resourceGroups/github-oidc-demo-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/11eb2a49-f2be-48ee-a1b3-113a01d79ffc/resourceGroups/github-oidc-demo-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/11eb2a49-f2be-48ee-a1b3-113a01d79ffc/resourceGroups/github-oidc-demo-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/11eb2a49-f2be-48ee-a1b3-113a01d79ffc/resourceGroups/github-oidc-demo-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/11eb2a49-f2be-48ee-a1b3-113a01d79ffc/resourceGroups/github-oidc-demo-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/11eb2a49-f2be-48ee-a1b3-113a01d79ffc/resourceGroups/github-oidc-demo-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "example-machine-pr" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "bda35bb1-425a-4d69-9acd-aaaf50768639" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "example-machine_OsDisk_1_8d55d24667d44f7baa4816497f7619f1" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jaredfholgate, Action: `pull_request`*